/*=======================================================================

	ベースゲームエンティティ [baseGameentity.cpp]

												長岡佑樹

=========================================================================*/

/////////////////////////////////////////////////////////
//
//	ヘッダファイル
//
/////////////////////////////////////////////////////////
#include "BaseGameEntity.h"

/////////////////////////////////////////////////////////
//
//	静的メンバ変数
//
/////////////////////////////////////////////////////////
int BaseGameEntity::m_iNextValidID = 0;

/////////////////////////////////////////////////////////
//
//	コンストラクタ
//
/////////////////////////////////////////////////////////
BaseGameEntity::BaseGameEntity(int ID):m_dBoundingRadius(0.0),
                                       m_vScale(Vector2D(1.0,1.0)),
                                       m_iType(default_entity_type),
                                       m_bTag(false)
{
  SetID(ID);
}

/////////////////////////////////////////////////////////////////////
//
//	SetID関数
//
//	IDが正しく設定されていることを確認するために、
//	各コンストラクター内で呼び出される必要がある
//	IDを設定して次の有効なIDをインクリメントする前に、
//	メソッドに渡された値が次の有効なID以上であることを検証する
//
/////////////////////////////////////////////////////////////////////
void BaseGameEntity::SetID(int val)
{
  // valが次の使用可能なID以上であることを確認する
  assert ( (val >= m_iNextValidID) && "<BaseGameEntity::SetID>: invalid ID");

  m_ID = val;
    
  m_iNextValidID = m_ID + 1;
}
