/*=======================================================================

	ウィンドウ表示処理 [light.cpp]

												AT-13C-245
												長岡佑樹

=========================================================================*/

/////////////////////////////////////////////////////////
//
//	ヘッダファイル
//
/////////////////////////////////////////////////////////
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "light.h"

/////////////////////////////////////////////////////////
//
//	定数定義
//
/////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////
//
//
//	初期化処理
//
//
/////////////////////////////////////////////////////////
void CLight::Init(void)
{
	D3DLIGHT9 light;
	// デバイスの設定
	LPDIRECT3DDEVICE9 pDevice = CRenderer::GetDevice();

	//ライトの設定
	ZeroMemory(&light, sizeof(D3DLIGHT9));

	light.Type = D3DLIGHT_DIRECTIONAL;
	light.Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);			// ライトの色
	light.Ambient = D3DXCOLOR(0.2f, 0.2f, 0.2f, 1.0f);			// 平行光源の色
	D3DXVECTOR3 vecDir = D3DXVECTOR3(0.0f, -1.0, 0.0f);			// 環境光の色(ライトベクトルの表示)
	D3DXVec3Normalize((D3DXVECTOR3*)&light.Direction, &vecDir);	// 平行光源の向き

	// デバイスライトを設定
	pDevice->SetLight(0, &light);
	pDevice->LightEnable(0, TRUE);
	pDevice->SetRenderState(D3DRS_LIGHTING, TRUE);
}
/////////////////////////////////////////////////////////
//
//
//	終了処理
//
//
/////////////////////////////////////////////////////////
void CLight::Uninit(void)
{
}
/////////////////////////////////////////////////////////
//
//
//	更新処理
//
//
/////////////////////////////////////////////////////////
void CLight::Update(void)
{
	
}
