/*=======================================================================
//
//	ポリゴン表示処理 [modegame.h]
//
//												AT-12D-249
//												長岡佑樹
//
//=========================================================================*/

////////////////////////////////////
//
//		ヘッダファイル
//
////////////////////////////////////
#ifndef _MODETITLE_H_
#define _MODETITLE_H_

////////////////////////////////////
//
//	ヘッダーインクルード
//
////////////////////////////////////
#include "main.h"
#include "mode.h"

class CBg;
////////////////////////////////////
//
//		プロトタイプ宣言
//
////////////////////////////////////
class CModeTitle : public CMode
{	
public:
	CModeTitle();
	~CModeTitle();
	void Init  (void);						// 初期化処理
	void Uninit(void);						// 終了処理
	void Update(void);						// 更新処理
	void Draw  (void);						// 描画処理
	
private:
	static CBg* m_pBg;						// 背景クラスの静的メンバ変数
	
};
///*------------------------------------------終了---------------------------------------------------*/
#endif