//=============================================================================
//
// プレイヤー処理 [polygon3D.h]
// Author : NAGAOKA YUKI
//
//=============================================================================
#ifndef _POLYGON3D_H_
#define _POLYGON3D_H_

///////////////////////////////////////////////
//
//		ヘッダファイル
//
////////////////////////////////////////////////
#include "scene3D.h"

///////////////////////////////////////////////
//
//		マクロ定義
//
////////////////////////////////////////////////


///////////////////////////////////////////////
//
//		構造体定義
//
////////////////////////////////////////////////
class CPolygon3D : public CScene3D
{
public:
	CPolygon3D(int Priority);						// コンストラクタ
	~CPolygon3D();						// デストラクタ
	static CPolygon3D *Create(void);	// オブジェクト生成処理
	void Init(void);				// 初期化処理
	void Uninit(void);				// 終了処理
	void Update(void);				// 更新処理
	void Draw(void);				// 描画処理
private:
};

#endif