/*=======================================================================

	サッカーメッセージズ [soccerMesages.h]

												
												長岡佑樹

=========================================================================*/
#ifndef SOCCER_MESSAGES_H
#define SOCCER_MESSAGES_H


/////////////////////////////////////////////////////////
//
//	ヘッダファイル
//
/////////////////////////////////////////////////////////
#include <string>


/////////////////////////////////////////////////////////
//
//	構造体 or 列挙型
//
/////////////////////////////////////////////////////////
enum MessageType
{
  Msg_ReceiveBall,
  Msg_PassToMe,
  Msg_SupportAttacker,
  Msg_GoHome,
  Msg_Wait
};

// 列挙された値を文字列に変換する
inline std::string MessageToString(int msg);


#endif