
//=============================================================================
//
// スコア処理 [time.h]
// Author : NAGAOKA YUKI
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_

///////////////////////////////////////////////
//
//		ヘッダファイル
//
////////////////////////////////////////////////
#include "scene.h"


class CNumber;
///////////////////////////////////////////////
//
//		マクロ定義
//
////////////////////////////////////////////////
#define TIME_NUM			(1)

///////////////////////////////////////////////
//
//		構造体定義
//
////////////////////////////////////////////////
class CTime : public CScene
{
public:
	CTime(int Priority);			// コンストラクタ
	~CTime();						// デストラクタ
	void Init(void);				// 初期化処理
	void Uninit(void);				// 終了処理
	void Update(void);				// 更新処理
	void Draw(void);				// 描画処理	
	static CTime *Create(void);	// オブジェクト生成処理

private:
	CNumber *m_apNumber[TIME_NUM];	// ナンバークラスの静的メンバ変数[表示する数字の最大数] 
	D3DXVECTOR3 m_pos;				// 表示座標
	D3DXVECTOR3 size;				// 幅、高さ
	int m_nTime;					// タイム変数
	int m_FrameTime;				// フレイムタイム
};

#endif